examples/last.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:sch="http://gost34.ibs.ru/WrapperService/Schema" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <xenc:EncryptionMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:gost28147"/>
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
                    <xenc:EncryptionMethod Algorithm="urn:ietf:params:xml:ns:cpxmlsec:algorithms:transport-gost2001"/>
                    <ds:KeyInfo>
                        <ds:X509Data>
                            <ds:X509Certificate>MIIBnTCCAUqgAwIBAgIBATAKBgYqhQMCAgMFADBUMQswCQYDVQQGEwJSVTEPMA0G
A1UEBxMGTW9zY293MSIwIAYDVQQKFBlPT08gIkdhcmFudC1QYXJrLVRlbGVjb20i
MRAwDgYDVQQDEwdUZXN0IENBMB4XDTE4MDkwNTEwMjExOFoXDTE5MDkwNTEwMjEx
OFowEzERMA8GA1UEAwwIMTIzNDU2NzgwYzAcBgYqhQMCAhMwEgYHKoUDAgIjAQYH
KoUDAgIeAQNDAARAT5xlBAs6MxnfJSuBSoWEubam/XlDrDlSd2ytZLkWfUWpLYYR
1myZ7xtICuysSojr0Sem9Qp+j+9nfQPMnlYLG6NEMEIwJQYDVR0lBB4wHAYIKwYB
BQUHAwIGCCsGAQUFBwMEBgYpAQEBAQIwCwYDVR0PBAQDAgKkMAwGA1UdEwEB/wQC
MAAwCgYGKoUDAgIDBQADQQAe0udrTwhaRlOtVAssVMKYz4HvY9lWQOfBIaduFbwt
Qfnz6vutf/feeC7DjIxflS55dO+S9/QDqDkOZjCH7gQk</ds:X509Certificate>
                        </ds:X509Data>
                    </ds:KeyInfo>
                    <xenc:CipherData>
                        <xenc:CipherValue>MIGkMCgEIN5PnBfFW+Tql2lMAsVxaCMfPciDKvVRoOlsmfGAwWPrBATW0P7ToHgGByqFAwICHwGgYzAcBgYqhQMCAhMwEgYH
KoUDAgIjAQYHKoUDAgIeAQNDAARAT5xlBAs6MxnfJSuBSoWEubam/XlDrDlSd2ytZLkWfUWpLYYR1myZ7xtICuysSojr0Sem
9Qp+j+9nfQPMnlYLGwQIf2WjtoV2LgQ=</xenc:CipherValue>
                    </xenc:CipherData>
                </xenc:EncryptedKey>
            </ds:KeyInfo>
            <xenc:CipherData>
                <xenc:CipherValue>NSh2kGlcUGagER8hrTdLU2mColDTUWYozTDAr6Ji0cpdb5MXzn+7AsOpSqLH/Wth87FncbSOAxTZzZLnYgWHhXh4a0j2rJtP
coC0CUep+DiC48/1qtBb0vTPzydj6ndaKyRrMFDlAbLpdKD8BC2z941uXMf/nxEzLXdncCO4lFMfX6bF2tBvU8BkTtBNJpT3
ENDGGWdxkJrZNLZqWLvi3Th4eVNOw7tybZkZKFTz0OgipYRdsCdonMjKdkip3HgqlpPciKOkAxJWXv8FRQIM2b082d4w4vNW
t27WKUnSBd9f5m9x0I7urmDJX+J2Lzscdl01WVLAsqGl+/6C8gmBs6qS2OIdwI5I+ZhlHv+AiYdl3EjPvW97vpWOiE9morHW
QTGdTQ3LN+UrvNtgtdLOYUAzLVHSc1ePIXa8MaIrHY67+7GeVhnHAUApBiR2WiIGkRgk7geGF3kgT8onfKbgdsxaCA0DilJ5
esNNyqjjG36IhHKH3K88XHebRqO98pUz6VO2yHKDrWF0Eu9l69tWnafe3UILo9ArLUd0o1AA9kPllKDIu6g95zFSUyeQarai
llUZ180kj2NRXHuJuCAphRdYpdOUOpZIVqSQ3PfTmhbPVqwPuo3ogy8vixw5qwa662fSvyjbZD7FjKk9OxOZtHfu5uftDKBl
kaabvHQ5MZcTNWbNeC47P7oopgoeT/msJhe9wVzNRZouSYF2iw7WiuZW5qXdMU7h/0iRLLDWpLteac6dIIyjZmCWwPkb2F06
MptYeEPnWe8jla8HchaD1IyccIfaElZE+k3/kBK4wIdx98+EDuyjkbS9ilLwmnfKkRbVbaRaNA395sCRy8X/0k2qrZsQjQZK
l8gNL0b7KA6V1lMu0H5EwbhH76UMfMDpFbjwlcOgdRqJO4WlMcF8uDHcNYcYtX8BLM8WQTiVlCQ4iMov0rrVREw2VU/sE1a7
xoZxjG4JcQSNcOHzxjJDSr0v4YTYkq455goTkmAWvCiqFTYOYbTiq+7nx6181DiMrA6GWijhdWTUvi2W/UCJIVYfW4gJTk5v
ct5pcD5ae9W4G3Nt5DzLtbWW+zAPDoL83ySvflv+KdzHjeYGJFYjmEGMPQ+8zqM1xmrjn2RJsbEi9WCESo19IHiD9lTLMOOK
Og0IBMFfAcAqIcdzCqDB9mA/Vjbw4Nd2vRsCp3kB65DjXtUtBuZKpDi4PuYY+1B9n8l/mc7tJGR1S5PEvyOtmYLP0XG5K4Lz
npBehMVMxJGtB3FYuk1JsrAWDtFmPaLXVDsYIIoLQn/8YVjfWF02ruZ3Jc6QNbYsT8AyU5mNgzuQEm5vh7rnOmQg5SDVrrZZ
ZFOP+1AUKkP4E36oALgc8+Wq273GGlZrYDu66bclVMD2Xl60bWVc9OSpHDZC2OM8h4OACzehlQ4mCqeMB/wINqqVboMQC9UT
GGpfvN5kN19bl+olvXH9ebWZMw0USfBiVsTsNegB741sgzEO9zEZjh6cDHyKdgB2qEl7Hp9q7KZh0MW6odEj8s/MWKZ1xgPb
y8Cc3vvbfpuCf1e+hWQrFVcBV8TGhRR7WhOZL8gmAkutJkhMi4QnsL4yapR8VbZLtRT9uRzH79NwTYEwfgEAXuXcOpsXMIZ/
f00N7AMdRU92Pd+X8u/SpbTwU0wAlranyWtzDVrRUfc8LqaUFGS2uem3OIOYkESpEf4SWyJ46MKvj/wB3YDSBAK6DcW9a0Mq
u4l6KPLCjg6FqQaWQEzV6VpbVL6l3E+7WO8HB2/PxD1LJlB2cFM7ydKihCf3V0buhT3Lh40ZbsAQrBOnvGGXyzdrtbfefVPT
WQe2VcqRFDlo4DUcCtvJPDg8UFa6KexSX8rgWjn3UBRLpBFDcL9lDj86rj9a3QHLaQ7VXUczWRsl5NLTuQlz4zwyjVHGsOTc
BHpdk0pE2WdeujROXfUwrji7Uc4z3M3OPja/EFpsLnQmAxi4j5pSRX9KMM3n62c8zUsZY0widYSoIKBMVVBtiCSt9aMA3jqX
uV9Q/FyzVCQzlMSFgM/XqseoyCTKBA9cKyrvomI04XN3H0Psche49a54aPpsqW1oAEr1zQbcBnSAWhXrhUX+bfrsZfkdM+9t
kmE3AV6KgQx7jZer+y/uzLi3HUJrY3HaBVlu09jmZ4hrtkErIetZETT0pkbpxWOX0l6UKIdfnoNVxRYwhYXmfxLRlyKFRpuD
JPTLu926bxpLnMixM3s2LdLLfMOSqe9XvZjJ6pyL7RKyehZ2u/FFpqGsiKwI/8D2X5PUC2NPtTxUUHZaq6EYZdthwXGDazJ/
d1N0qMVa0Jw5mWo4irh8SGfsn4129TfMf2SZJAwCbshcNIV31Ch10PxyccRxSGVJExO4J1MOlOVGn8VSRknOBiaK4WGBZf2u
8z9e5g6TfBoN477JzD+KQzvFhzrODhPlTlTUlNCvm082f/nhyIRrVORIPQVoyOY6NT7lIYagP54gMdBy34GZOO9LhLr1fGCI
VFTEE4JI2n0x3BSKgtKLPJ8WCGvRRH9HP1CSB/pzpS9FlsMs4HdBbLOgfwUD6qagfwykIH3Wz9BtghvQ7I3YRgcUpgm4wShK
v5Or5EAJkSrXrmw6iI5bKlXT5pNFsPF5GGqNgpR4VwVdF5rAf0cPO6wsBuugnk92I8ROhrrCOZC8+ijlUcUXfSmy5x49VjAv
YvZOX2ZTLUoI1u0CM5BymCVwOxyrU10XjgOzKP3TdBjDntzJ3JbMDxQVxe6hjKaE3SscWZmX+yWT1Mx7zrIHgGGIXLMPbpPT
l+5sqF7epX4M3hXdvRGDbhAAUwxFE1a8eeM3FgcYm6apYeaP9sKGZ9N6m4YPqAZ5ZVnzqVEgeZYre5hIrMms2KYeem4bfwXA
PKbAJPSlsTpUouAiZacsBWnCjkjJS1I5zCqOS0ztU+QSaStGTvy8LH0rIL2wTR0nu6NDGHlwHbcyAr7b7SNmd+FJwVGUBPti
2feAfb7w0MdKk8pSDKdGXiwNO3Uu6e1Bahcnqj7kXnyKVwWSkO1+CP/1f7eYsJDlzyxDCGgUIzxzSRsCYtlqYaBgj0Rr/p6T
0fvNXw+BJDKgqmUVxc+yyyTyMpg3F++EZOrmdHUy3ExKcOgIwbL0UAbJ6MsMi9RJ/y0mKm1UZYfyQ5BMvJMlAtWvs1fOtrXp
kn1o+u8EPdUQoOclR8LD4YBm1Um7vky76aN9ZArj1KYR2VxcGuUVWWyxlEoqP2/HJ5wA5EhQxLwXIWlvH7QY6itY7hIdu/tJ
vYxSD8Kw+J4kHtiSdCv8kiVNf4HrxHJVdv3JcrVMllSIssX5VsfOBAAedk4Q62ulyOEbW88YozkvVBWWE9xzLdx7znWFYs+X
9WExcMO/tBlATC5PXYFQe5JBNmUfgk7weTPnazjxhg3LhTbzHlFterP0q7+pfBHGt+sCeCYwGE8a1UvRpncfBNTIbwIC+x2v
v7T8Tp69THuN7BRk1MEanzz5cq7jleUMp3MH+CeJ7uEJt73MtNWaCJDv4Auia0bMGA0MUL1mtFaQ/Aib5QmkFQjcpMVj0BF2
mJBPlrU+gO36vjrv8492Eg33iYcz4L67ZZJQ7uA8CCRF3QEA1QWCU9gS8HKyW3DoubC2pvaNOiGMjuLIYa0sKodqvQrOPAOU
eoh0gwedeMJLRnZDKWueUQmrKWSHLK/8j6GEy1XieLj6Ta0DxAxYBrvuOmXyeJgaL1enHtJjDv/2mAjH2Hi7W4otSmP68I+g
wFFmulM4u6Cb59iyvczguX01xSOU125VLW6wOQ7eEIZaIpDnd0k4CuigLxdLyR8I1lumDBs+bAJbSiYfQ2cYEh6T2h00fnuq
C//RwKaWfxV490quPF55nkIXFSzVtnToxaG/KRLrkl1qwD44nVG3g2kmmpSMmd7XweTm3YiNf2sp46p5xHjPmyedpP3QPLif
k7AgawmzgymbTI8AydF31bayWm+WBAw06IWLATXHJjsJ3crvdMNn3JV9Eg/mvgeqPNvqKLUTOC8ap7krsAtCmFNy8ZV7opP0
Kzwtc+7SQJj5ZTa9nZ7fOep+9ZUWxhb/XSctkMzdfbrEtsuOz7ux9VJwnYioYM9N0ir7MRggaYIELR5ojVDGLI2gGEgvyvUp
ctwH2nIVPb3miiAaC93AkDGqK+Wa0MqAoNC9ZqfL4nNH46mK0dZ4OoHaD8rRpSLDMDawHmusQm4hi4nK9HcNbKZwimDealX/
Z+B1bUdtylgPOqCSWjB2JCzlEgXQ4vmRQQs/x/COY/VAyvd0M8tdL4XaiSnqe8tc72EP3DnyR1jdGPNhTqM9q+wxV/aOP8dH
fhtaSZ8O5LE2e3L5pObl3jsiWAW4sQTj3Vd3h/6rKm23LYhmD7MwU52aywIzK1nPd2jH/+3nzZ6UZMVLhBrHX8qABJ5eIISC
2qRqDkhVYGfuOhANYL4P41OtnnHoQO2YqeqvaAU=</xenc:CipherValue>
            </xenc:CipherData>
        </xenc:EncryptedData>
    </soapenv:Body>
</soapenv:Envelope>